app/views/users/show.html.erb

SELECT COUNT(*) FROM "songs" WHERE "songs"."user_id" = 5
---
          <tbody>
            <% @user.songs_added.select(:artist, :title, :id).group(:artist, :title, :id).having("count(*) >= 1").size.each do |key, value| %>

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 2]]
---
<<<<<<< HEAD
                <td><%= @user.songs_added.where(id: key[2]).count %></td>