app/views/songs/index.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "playlists" ON "users"."id" = "playlists"."user_id" WHERE "playlists"."song_id" = $1  [["song_id", 1]]
---
                      <td><a href="<%= song_url(song) %>" class="light-blue-text text-accent-2"><%= song.title %></a></td>
                      <td><%= song.users.count %></td>