app/views/songs/show.html.erb

        <tbody>
          <% @this_song.users.select(:first_name, :last_name, :email, :id).group(:first_name, :last_name, :email, :id).having("count(*) >= 1").size.each do |key, value| %>
---
SELECT COUNT(1) FROM "users" INNER JOIN "playlists" ON "users"."id" = "playlists"."user_id" WHERE "playlists"."song_id" = $1  [["song_id", 3]]