app/controllers/main_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "josh.reese@dojo.com"]]
---
  def login
    @user = User.find_by_email(params[:email])