app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("song_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["song_id", 6], ["user_id", 5], ["created_at", "2018-08-18 15:57:43.015871"], ["updated_at", "2018-08-18 15:57:43.015871"]]
---
  def add_to_playlist
    Playlist.create(song_id: params[:id], user_id: current_user.id)