app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1 AND "playlists"."id" = $2 LIMIT 1  [["user_id", 5], ["id", 1]]
---
  def index
    @allsongs = Song.all
    # @allsongs = Song.where(state: current_user.playlists)
    @othersongs = Song.where.not(state: current_user.playlists)

INSERT INTO "songs" ("title", "artist", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Dombolo"], ["artist", "Michael Jackson"], ["created_at", "2018-08-18 02:23:15.413441"], ["updated_at", "2018-08-18 02:23:15.413441"]]
---
  def create
    @new_song = Song.create(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    print "\n\n===============================\n\n"
    puts "BEFORE"
    print "\n\n===============================\n\n"
    @this_song = Song.find(params[:id])

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 20]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 20]]
---
  def destroy
  Song.find(params[:id]).delete