app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @playlist = @user.playlists
    @this_user = "#{@user.first_name} #{@user.last_name}"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 1]]